{
    "name": "Nageshwar / Nagnath",
    "meaning": "Lord of Serpents / King of Nagas",
    "other_names": [
        "Nagnath",
        "Nageshwaram",
        "Darukavanam Nageshwar"
    ],
    "epithets": [
        "Naga Raja - King of Serpents",
        "Supriya Rakshak - Protector of Supriya",
        "Visha Hara - Remover of Poison",
        "Daruka Nashak - Destroyer of Demon Daruka"
    ],
    "iconography": {
        "form_here": "The Nageshwar Jyotirlinga is set in a sanctum facing east. The temple complex's most striking feature is the 82-foot statue of meditating Shiva, visible from great distance. The main lingam is relatively small but radiates protective energy.",
        "symbolism": {
            "serpent_mastery": "Shiva as Nageshwar represents mastery over kundalini energy (serpent power), protection from poison (physical and spiritual), and authority over the snake kingdom",
            "devotee_protection": "The temple's origin story emphasizes that sincere worship attracts divine protection—even in impossible circumstances",
            "dwarka_proximity": "Near Krishna's city, Nageshwar represents the unity of Shaiva and Vaishnava traditions in Gujarat"
        }
    },
    "mythology": {
        "origin_story": "A Shiva devotee named Supriya was captured by the demon Daruka and imprisoned in his underwater fortress called Darukavana. Despite torture and threats, Supriya continued his Shiva worship, even teaching other prisoners to chant Om Namah Shivaya. Enraged, Daruka came to kill him. At that moment, Shiva manifested in blazing light, destroyed the demon with his trident, and remained as Nageshwar to protect all devotees.",
        "key_episodes": [
            {
                "title": "Daruka's Terror",
                "story": "The demon Daruka had received a boon from Parvati that made him invincible to most beings. With his wife Daruki, he terrorized sailors and coastal dwellers, imprisoning them in his underwater city."
            },
            {
                "title": "Supriya's Unwavering Faith",
                "story": "Even in chains, even facing death, Supriya continued his japa. He told the other prisoners: 'Death may take this body, but devotion connects me to the Eternal.' His faith was so pure that other prisoners began chanting with him."
            },
            {
                "title": "Divine Intervention",
                "story": "When Daruka raised his weapon to kill Supriya, Shiva emerged from the devotee's heart as blinding light. The demon and his fortress were destroyed instantly. Where the light touched the earth, the Nageshwar Jyotirlinga manifested."
            }
        ]
    },
    "worship": {
        "primary_mantra": {
            "sanskrit": "ॐ नागेश्वराय नमः",
            "transliteration": "Om Nageshwaraya Namah",
            "translation": "Salutations to the Lord of Serpents",
            "meaning": "Invokes Shiva's protective aspect against serpents, poison, and all that threatens devotees"
        },
        "offerings": [
            "Milk (especially for serpent deities)",
            "Bilva leaves",
            "Dhatura flowers",
            "Sacred ash",
            "White flowers"
        ],
        "festivals": [
            {
                "name": "Nag Panchami",
                "timing": "July/August",
                "significance": "Serpent worship day; major celebration here"
            },
            {
                "name": "Maha Shivaratri",
                "timing": "February/March",
                "significance": "All-night worship with large gatherings"
            }
        ]
    },
    "philosophy": {
        "core_teaching": "Nageshwar teaches that devotion in adversity is the most powerful devotion. Supriya's worship while imprisoned and facing death attracted Shiva himself. When you face your darkest hour, intensify your practice—that is when grace flows most freely.",
        "protection_energy": "The Lord of Serpents protects against all forms of 'poison'—not just physical venom but toxic relationships, cursed karma, and spiritual obstacles that coil around our lives."
    }
}