{
    "name": "Ramanathaswamy / Rameshwaram",
    "meaning": "Lord of Rama / Lord worshipped by Rama",
    "other_names": [
        "Ramanatha",
        "Sethu Madhava (for Vishnu aspect)",
        "Dhanushkodi Nath"
    ],
    "epithets": [
        "Ramalinga - Lingam established by Rama",
        "Sethu Nath - Lord of the Bridge",
        "Dakshin Kashi - Southern Varanasi",
        "Char Dham - One of four cardinal pilgrimage points"
    ],
    "iconography": {
        "form_here": "There are actually TWO lingams in Rameshwaram—the main Ramalingam installed by Lord Rama, and a smaller one brought by Hanuman from Kailash. Rama honored Hanuman's lingam with first worship rights as reward for his devotion.",
        "symbolism": {
            "rama_worship": "Vishnu (as Rama) worshipping Shiva demonstrates the unity of different forms of God—sectarian divisions dissolve here",
            "22_wells": "The 22 theerthams represent complete purification—physical, mental, and spiritual cleansing through sacred water",
            "ram_setu": "The ancient bridge represents the power of devotion to overcome impossible obstacles",
            "longest_corridor": "The massive corridor represents the endless path of devotion—pilgrims walk great distances within the temple"
        }
    },
    "mythology": {
        "origin_story": "After rescuing Sita from Lanka and slaying Ravana, Lord Rama wished to be absolved of the sin of killing a Brahmin (Ravana, despite being a demon, was a learned Brahmin). The sages advised him to worship Shiva on the shore before returning to Ayodhya. Rama sent Hanuman to bring a lingam from Kailash, but when Hanuman was delayed, Sita sculpted a lingam from the sand. When Hanuman returned with the Kailash lingam, Rama—to honor his devotee's effort—established both, giving Hanuman's lingam priority of worship.",
        "key_episodes": [
            {
                "title": "Building the Ram Setu",
                "story": "At this very spot, Rama's vanara army built the bridge to Lanka. Rocks inscribed with Rama's name floated on water. The engineering feat—whether mythological or historical—is testified by the underwater ridge still visible today."
            },
            {
                "title": "Hanuman's Devotion Rewarded",
                "story": "Though Rama had already installed the sand lingam before Hanuman returned, he ruled that Hanuman's lingam from Kailash would receive first worship forever. This teaches that sincere effort is rewarded even if the task is no longer needed."
            },
            {
                "title": "The 22 Sacred Wells",
                "story": "Each theertham within the temple carries water from different sacred rivers, brought here by Rama himself. Bathing in all 22 in sequence is equivalent to bathing in every holy river of India."
            }
        ]
    },
    "worship": {
        "primary_mantra": {
            "sanskrit": "ॐ रामनाथाय नमः",
            "transliteration": "Om Ramanathaya Namah",
            "translation": "Salutations to the Lord of Rama",
            "meaning": "Honors Shiva as worshipped by Rama; invokes both Shaiva and Vaishnava blessings"
        },
        "offerings": [
            "Bilva leaves",
            "Milk",
            "Coconut",
            "Flowers",
            "Sandal paste"
        ],
        "festivals": [
            {
                "name": "Maha Shivaratri",
                "timing": "February/March",
                "significance": "Major celebration with massive crowds"
            },
            {
                "name": "Navratri",
                "timing": "September/October",
                "significance": "Nine nights of goddess worship"
            },
            {
                "name": "Thai Poosam",
                "timing": "January/February",
                "significance": "Local Tamil festival with spectacular processions"
            }
        ]
    },
    "philosophy": {
        "core_teaching": "Rameshwaram dissolves the false division between Shaivas and Vaishnavas. When Rama worships Shiva, when Hanuman's lingam receives first honors, we see that all paths lead to the same divine reality. Sectarian identity falls away at this sacred shore.",
        "complete_pilgrimage": "As one of the four Char Dhams (with Badrinath, Dwarka, and Puri), Rameshwaram represents the southern point of Indian pilgrimage. Visiting all four constitutes a complete circumambulation of sacred Bharat."
    }
}