{
    "name": "Someshwara / Somnath",
    "meaning": "Lord of the Moon / Lord of Soma (lunar nectar)",
    "other_names": [
        "Someshwara",
        "Prabhasa Pati",
        "Bhaleshwar",
        "Deo Patan"
    ],
    "epithets": [
        "Chandrashekhar - Bearer of the Moon",
        "Mrityunjaya - Conqueror of Death",
        "Sarveshwara - Lord of All",
        "Jagatpita - Father of the World",
        "Mahakala - Lord of Time",
        "Tryambaka - Three-Eyed One"
    ],
    "iconography": {
        "form_here": "The Jyotirlinga at Somnath is a cylindrical black stone lingam, smaller than you might expect given the temple's fame. It sits in the garbhagriha (inner sanctum) below ground level—you descend steps to reach it. The silver cover (removed during worship) protects the ancient form.",
        "symbolism": {
            "moon_connection": "The crescent moon on Shiva's head represents mastery over time and mental fluctuations. Soma (moon) was 'tamed' and given shelter by Shiva here.",
            "ocean_placement": "Temple faces west toward the endless ocean—symbolizing Shiva as the boundary between known and unknown, finite and infinite",
            "subterranean_sanctum": "The below-ground-level sanctum represents going 'within' to find the divine, and also the lingam 'emerging from the earth'",
            "silver_covering": "Practical protection, but also represents Maya (illusion) covering the formless reality"
        },
        "special_features": {
            "garbhagriha_dome": "Contains carving of the Moon restored to luminosity",
            "north_south_doors": "Architectural precision—light enters at specific angles during equinoxes",
            "arrow_pillar": "External marker showing geographic-spiritual significance"
        }
    },
    "mythology": {
        "origin_story": "The Moon god (Soma/Chandra), cursed by his father-in-law Daksha to wane and die for showing favoritism among his 27 wives (the Nakshatra stars), came to Prabhas Kshetra to perform penance. For six months, Soma prayed continuously to Shiva. Finally, Mahadeva appeared and declared: 'The curse cannot be fully revoked, but I will give you cyclical restoration. You will wax and wane forever, but never truly die. And I will remain here as your Lord—Somnath.' This is why the first Jyotirlinga manifested here, and why Somnath is associated with emotional/mental healing (the Moon governs the mind in Hindu astrology).",
        "key_episodes": [
            {
                "title": "Why the Moon Was Cursed",
                "story": "Chandra married all 27 daughters of Daksha (representing the 27 Nakshatras). But he spent disproportionate time with Rohini (his favorite), neglecting the others. The other 26 wives complained to their father. Daksha, furious at the disrespect, cursed Chandra to fade away. The Moon's waning began—and the only remedy was Shiva's intervention at what became Somnath."
            },
            {
                "title": "The Saraswati's End",
                "story": "Somnath sits where the Vedic river Saraswati is said to have met the ocean (though the river is now dry/mythical in most places). This made it a triple tirtha: sacred river, ocean, and Jyotirlinga. Some scholars believe Somnath was a major port city in ancient times, explaining its legendary wealth."
            },
            {
                "title": "Sardar Patel's Vow",
                "story": "In 1947, Sardar Vallabhbhai Patel visited the ruins of Somnath and famously declared: 'The power of creation is always greater than the power of destruction.' He championed reconstruction despite PM Nehru's objections that the government shouldn't fund religious sites. Patel died in 1950; the temple was inaugurated in 1951 by President Rajendra Prasad. For many, this reconstruction symbolizes Hindu civilizational continuity after centuries of destruction."
            }
        ]
    },
    "worship": {
        "primary_mantra": {
            "sanskrit": "ॐ नमः शिवाय",
            "transliteration": "Om Namah Shivaya",
            "translation": "I bow to Shiva",
            "meaning": "Universal Shiva mantra, applicable at all Shiva temples"
        },
        "somnath_specific": {
            "text": "सोमेश्वराय नमः",
            "transliteration": "Someshwaraya Namah",
            "meaning": "Salutations to the Lord of the Moon"
        },
        "offerings": [
            "Bilva leaves (standard Shiva offering)",
            "White flowers (Moon's color)",
            "Milk (associated with Moon energy)",
            "Silver items (Moon's metal)",
            "Gangajal (though seawater is also used here)"
        ],
        "festivals": [
            {
                "name": "Kartik Purnima",
                "timing": "November full moon",
                "significance": "Full moon when Moon's restoration is celebrated. Massive crowds, all-night worship."
            },
            {
                "name": "Maha Shivaratri",
                "timing": "February/March",
                "significance": "Great Night of Shiva—major celebration at all Jyotirlingas"
            },
            {
                "name": "Somnath Mahotsav",
                "timing": "December",
                "significance": "Multi-day cultural and spiritual festival specific to Somnath"
            }
        ]
    },
    "philosophy": {
        "core_teaching": "Somnath teaches resilience. The Moon was cursed but not destroyed—he cycles forever. The temple was destroyed 17 times but rebuilt 18. The message: genuine truth cannot be permanently erased. What rises and falls is form; that which underlies form is eternal. Worshipping here is connecting to that eternal substrate that survives all attacks.",
        "moon_and_mind": "In Hindu astrology, the Moon (Chandra) governs Manas (mind, emotions, mental fluctuations). Soma also means 'nectar.' The mind, like the Moon, waxes and wanes—sometimes bright, sometimes dark. Somnath teaches that Shiva (pure Awareness) is the stable witness behind mental fluctuations. Worshipping here is said to bring mental stability and emotional healing.",
        "first_jyotirlinga": "As the first of the 12, Somnath represents the primal manifestation of Shiva's light on Earth. In the sequence of sacred geography, this is where the cosmic begins touching the terrestrial. The ocean meeting land, river meeting sea, heaven meeting earth—Somnath is a boundary space between realms."
    }
}