{
    "spiritual_invitation": "Welcome to Baba Baidyanath Dham, where Shiva manifests as the Divine Physician. At this sacred site, even the demon king Ravana found healing and grace. Whatever ailment you carry—physical, emotional, or spiritual—the Lord of Physicians awaits with cosmic medicine.",
    "spiritual_benefits": [
        {
            "blessing": "Divine Healing",
            "significance": "Vaidyanath is specifically worshipped for healing. Countless devotees report miraculous cures—from chronic illnesses to conditions doctors couldn't treat. The healing energy here is tangible.",
            "experience": "Pray with specific healing intentions. Offer Ganga water to the lingam while visualizing complete recovery."
        },
        {
            "blessing": "Kanwar Yatra Blessing",
            "significance": "Participating in the Kanwar Yatra—walking with Ganga water to offer here—is considered one of the most powerful spiritual practices. The collective devotion of 20 million Kanwariyas creates an extraordinary energy field.",
            "experience": "If visiting during Shravan, even witnessing the Kanwar procession bestows blessings. Offering Ganga jal here multiplies spiritual merit immensely."
        },
        {
            "blessing": "Grace Beyond Judgment",
            "significance": "If Shiva blessed Ravana despite his demonic nature, the Lord will certainly bless sincere devotees regardless of their imperfections. This temple teaches radical acceptance and divine compassion.",
            "experience": "Come as you are. The Lord who healed Ravana sees your devotion, not your faults."
        }
    ],
    "practical_guide": {
        "best_time": {
            "season": "October to March for comfortable weather. Shravan month (July-August) for the extraordinary Kanwar Yatra experience.",
            "auspicious_days": "Mondays during Shravan, Maha Shivaratri",
            "sacred_hour": "Early morning (4-6 AM) darshan is most peaceful"
        },
        "sacred_rituals": [
            "Jalabhishek - Offering Ganga water to the lingam",
            "Kanwar Yatra - Walking pilgrimage with sacred water",
            "Rudrabhishek - Elaborate sacred bathing ceremony",
            "22 Temple Circuit - Visiting all shrines in the complex"
        ],
        "darshan_options": {
            "general": "Free darshan for all devotees",
            "special_puja": "₹251 - ₹2,100 for various ritual options"
        }
    },
    "who_will_be_blessed": [
        "Those seeking healing from illness",
        "Kanwar Yatra devotees completing their pilgrimage",
        "Those feeling unworthy but seeking divine grace",
        "Shiva devotees drawn to dramatic mythological connections",
        "Pilgrims experiencing one of the world's largest religious gatherings"
    ],
    "pilgrimage_blessing": "May Baba Baidyanath, the Divine Physician, heal all that ails you—visible and invisible. May the grace that healed Ravana's arms now heal your life. May you walk forward in health, protected by the Lord's cosmic medicine. 🙏 ॐ वैद्यनाथाय नमः"
}