{
    "spiritual_invitation": "🙏 Welcome to Grishneshwar, the twelfth and final Jyotirlinga, where Lord Shiva manifested as the embodiment of compassion. Here, Ghushma's devotion moved the Lord—not with her power, but with her capacity to forgive. This is the Jyotirlinga of the heart. If you carry grief over wounds caused by others, lay them here. Grishneshwar takes away grief and grants the divine gift of mercy.",
    "blessings": [
        {
            "title": "Healing of Emotional Wounds",
            "blessing": "May Grishneshwar, the Lord who removes grief, heal all emotional pain and past hurts",
            "significance": "The name Grishneshwar means 'Lord who takes away grief.' Devotees come specifically to heal heartbreak, betrayal, loss, and emotional wounds.",
            "experience": "Pray while focusing on specific hurts or losses, consciously surrendering them to the Lord"
        },
        {
            "title": "Gift of Forgiveness",
            "blessing": "May you receive the divine gift of being able to forgive those who have wronged you",
            "significance": "Ghushma asked for her tormentor to be forgiven. True devotion leads to compassion, not revenge. This temple grants that capacity.",
            "experience": "Pray specifically for the ability to forgive someone who has hurt you"
        },
        {
            "title": "Completion of Sacred Journey",
            "blessing": "If completing your Dwadash Jyotirlinga yatra, may the merit of all twelve lingas combine in blessing you",
            "significance": "As the 12th Jyotirlinga, Grishneshwar completes the sacred circuit. The Shiva Purana promises moksha to those who visit all twelve with devotion.",
            "experience": "Take a moment to recall and thank Lord Shiva for the grace received at all twelve Jyotirlingas"
        }
    ],
    "pilgrimage_blessing": "As you leave Grishneshwar, the gentle twelfth Jyotirlinga, may the Lord's compassion fill your heart. Whether this was your first Jyotirlinga or your last in the sacred circuit, carry with you the lesson of Ghushma: that the highest devotion expresses itself as forgiveness. Go forth with a lighter heart, the grief lifted, ready to show mercy as you have received it. 🙏 ॐ घृष्णेश्वराय नमः"
}