{
    "name": "Trimbakeshwar / Tryambakeshwar",
    "meaning": "Lord of the Three (Trimurti) / Three-Eyed Lord",
    "other_names": [
        "Tryambakeshwar",
        "Trimbak Nath",
        "Godavari Jyotirlinga"
    ],
    "epithets": [
        "Tryambaka - Three-Eyed One",
        "Trimurti Linga - Lingam of the Three Gods",
        "Godavari Janaka - Father of the Godavari",
        "Mrityunjaya - Conqueror of Death"
    ],
    "iconography": {
        "form_here": "The Trimbakeshwar Jyotirlinga is uniquely three-faced, with each face representing Brahma (creator), Vishnu (preserver), and Mahesh/Shiva (destroyer). This Trimurti representation is not found in any other Jyotirlinga. The lingam is small, protected by a silver frame, and sometimes covered by a natural crown (mukuta) formed by water streams.",
        "symbolism": {
            "three_faces": "The Trimurti in single form represents the unity of cosmic functions—creation, preservation, dissolution are not separate forces but one divine dance",
            "water_crown": "Natural water streams forming a crown over the lingam symbolize Shiva as the source of all rivers, all life-giving waters",
            "godavari_origin": "As origin point of the Godavari, this temple represents the place where the formless divine becomes flowing, life-giving river",
            "brahmagiri": "The mountain behind the temple represents Brahma—even the Creator bows before Mahadeva"
        },
        "special_features": {
            "kushavarta_kund": "The exact spot where Godavari emerges—considered among the holiest tanks in India",
            "silver_mask": "The Trimurti faces are protected by silver coverings, removed during special darshans",
            "narayan_nagbali": "Special ritual hall for ancestral rites available nowhere else",
            "ancient_architecture": "Nagara-style temple with intricate carvings from Maratha period"
        }
    },
    "mythology": {
        "origin_story": "The sage Gautama lived on Brahmagiri hill with his wife Ahalya. During a great famine, Gautama's ashram alone had food due to his powers. Jealous sages conspired against him, creating an illusory cow that died when Gautama touched it. Accused of go-hatya (cow-killing), Gautama performed severe penance to Shiva for purification. Pleased, Shiva released the Ganga from his matted locks to flow as Godavari, purifying the land. The sage then requested Shiva to remain forever, and the Lord manifested as the Trimbakeshwar Jyotirlinga.",
        "key_episodes": [
            {
                "title": "The Conspiracy Against Gautama",
                "story": "The other sages, jealous during the famine, used maya to create a false cow. When it died at Gautama's touch, they accused him of the worst sin. Rather than defend himself, Gautama accepted the punishment and began penance—his humility and devotion eventually revealed the truth and brought Godavari to earth."
            },
            {
                "title": "Ganga Becomes Godavari",
                "story": "When Shiva released Ganga from his locks at Trimbakeshwar, she took the name 'Godavari' meaning 'giver of salvation.' Unlike her northern flow as Ganga, here she flows south toward Dakshina—carrying Shiva's blessing to the southern lands."
            },
            {
                "title": "The Trimurti Revelation",
                "story": "The three-faced form was not always visible. After centuries of worship, a great sage's intense tapas 'awakened' the Trimurti within the lingam. The priests say this represents a deeper truth—all Jyotirlingas contain the Trimurti, but only here has that inner form been revealed."
            }
        ]
    },
    "worship": {
        "primary_mantra": {
            "sanskrit": "ॐ त्र्यंबकं यजामहे सुगंधिं पुष्टिवर्धनम्",
            "transliteration": "Om Tryambakam Yajamahe Sugandhim Pushtivardhanam",
            "translation": "We worship the Three-Eyed One who is fragrant and nourishes all beings",
            "meaning": "The Mahamrityunjaya Mantra—the great death-conquering mantra—originates here"
        },
        "additional_mantras": [
            {
                "name": "Complete Mahamrityunjaya",
                "sanskrit": "ॐ त्र्यंबकं यजामहे सुगंधिं पुष्टिवर्धनम् उर्वारुकमिव बंधनान्मृत्योर्मुक्षीय माऽमृतात्",
                "benefit": "Conquering fear of death, healing, longevity"
            },
            {
                "name": "Trimurti Dhyana",
                "sanskrit": "ब्रह्मा विष्णुश्च रुद्रश्च त्रिमूर्तिरिति संस्थिता",
                "benefit": "Meditation on the unified Trimurti"
            }
        ],
        "offerings": [
            "Bilva leaves (especially sacred here)",
            "Godavari water from Kushavarta",
            "White flowers",
            "Rudraksha (sacred beads)",
            "Sacred ash (bhasma)"
        ],
        "festivals": [
            {
                "name": "Simhastha Kumbh Mela",
                "timing": "Every 12 years (next: around 2027)",
                "significance": "Millions gather for holy dip; once-in-a-lifetime experience"
            },
            {
                "name": "Maha Shivaratri",
                "timing": "February/March",
                "significance": "All-night worship with massive crowds"
            },
            {
                "name": "Shravan Month",
                "timing": "July/August",
                "significance": "Daily special pujas; Monday crowds"
            }
        ]
    },
    "philosophy": {
        "core_teaching": "Trimbakeshwar reveals that the cosmic forces we perceive as separate—creation, preservation, destruction—are unified in one divine reality. The Trimurti lingam visually teaches non-duality: Brahma, Vishnu, and Shiva are not three gods but three faces of one Absolute.",
        "death_transcendence": "This is the home of the Mahamrityunjaya Mantra—the death-conquering prayer. Trimbakeshwar teaches that death is not an end but a transformation. Those who realize the Trimurti's unity see past the illusion of individual mortality.",
        "source_symbolism": "As the Godavari's source, Trimbakeshwar reminds us that mighty rivers begin from single points. Great traditions emerge from focused origins. Your own spiritual journey, focused here, can become a river of blessing flowing through your life."
    }
}