{
    "spiritual_invitation": "The first Jyotirlinga, blessed by the Moon God himself, welcomes you to the shores of the Arabian Sea. Somnath stands as an eternal testament to faith - destroyed 17 times yet always rebuilt, symbolizing the indestructible nature of Dharma.",
    "spiritual_benefits": [
        {
            "blessing": "Healing Energies of the Moon",
            "significance": "Soma (the Moon) was cursed to fade away but was restored to full glory by worshipping Shiva here. Somnath is traditionally associated with mental peace, emotional healing, and renewal - just as the Moon waxes after waning.",
            "experience": "Attend the evening Aarti facing the sea. The combination of sunset, ocean, sacred fire, and chanting creates a profoundly healing atmosphere."
        },
        {
            "blessing": "First Among Twelve Jyotirlingas",
            "significance": "As the first Jyotirlinga, Somnath holds primacy among the twelve sacred sites. Beginning your Jyotirlinga pilgrimage here sets a blessed foundation for the entire spiritual journey.",
            "experience": "If planning a Dwadash Jyotirlinga yatra, make your sankalpa (sacred intention) here at Somnath - the first of the twelve."
        },
        {
            "blessing": "Symbol of Eternal Dharma",
            "significance": "Somnath teaches that faith cannot be destroyed. Despite all destructions, the sacred site remained, and the temple was rebuilt each time. Worshipping here connects you to this unbreakable chain of devotion.",
            "experience": "Stand before the temple and contemplate the centuries of devotees who kept the faith alive. You are now part of this eternal story."
        }
    ],
    "practical_guide": {
        "best_time": {
            "season": "October to March offers pleasant coastal weather for pilgrimage",
            "auspicious_days": "Kartik Purnima (November full moon) is especially sacred. Mahashivaratri brings the temple alive.",
            "sacred_hour": "Sunset Aarti (7 PM) is the signature experience of Somnath - absolutely not to be missed."
        },
        "sacred_rituals": [
            "Sunset Aarti - The ocean-facing fire ceremony at dusk",
            "Sound and Light Show - Experience the inspiring saga of the temple's resilience",
            "Morning Rudrabhishek (5:30 AM) - Personal worship at the Jyotirlinga",
            "Bhalka Tirtha - Visit where Lord Krishna departed (5 km away)",
            "Arrow Pillar - See the ancient inscription marking the temple's location"
        ],
        "darshan_options": {
            "general": "Free darshan for all devotees",
            "rudrabhishek": "₹501 - ₹5,000 for personal ritual"
        },
        "recommended_visits": {
            "bhalka_tirtha": "Sacred site of Krishna's departure (5 km)",
            "triveni_sangam": "Confluence of three rivers (10 km)",
            "dwarka": "City of Lord Krishna (240 km)"
        }
    },
    "who_will_be_blessed": [
        "Those seeking mental peace and emotional renewal",
        "Shiva devotees beginning the Dwadash Jyotirlinga pilgrimage",
        "History enthusiasts inspired by the temple's resilience",
        "Pilgrims wanting a peaceful, manageable temple experience",
        "Krishna devotees combining Somnath with Dwarka and Bhalka Tirtha"
    ],
    "pilgrimage_blessing": "May Lord Somnath illuminate your path as He illuminated the Moon. May the sacred waters of the Arabian Sea wash away all sorrows. May you carry the eternal flame of Dharma in your heart. Har Har Mahadev! 🙏"
}