[
    {
        "id": "buffalo",
        "category": "Origin",
        "title": "The Buffalo's Back",
        "hook": "Shiva hid from the Pandavas by becoming a buffalo—but his hump remained in Kedarnath",
        "full_story": "After the Mahabharata war, the Pandavas sought Shiva's forgiveness for killing their kinsmen. Shiva, unwilling to absolve them of such karma, fled to the Himalayas disguised as a buffalo. When Bhima spotted him, Shiva dove into the earth. Bhima grabbed the buffalo's hump as it descended—and that triangular rock formation is what you see today as the Kedarnath Jyotirlinga. The other body parts surfaced at four other locations: navel at Madmaheshwar, arms at Tungnath, face at Rudranath, and hair at Kalpeshwar. Together they form the Panch Kedar pilgrimage.",
        "source": "Kedar Khanda, Skanda Purana",
        "image": "data/temples/kedarnath/images/kedar_buffalo_origin.png",
        "verified": true
    },
    {
        "id": "flood",
        "category": "Miracle",
        "title": "Divine Protection: 2013 Miracle",
        "hook": "The temple stood untouched, protected by the ancient Bhim Shila boulder",
        "full_story": "On June 16-17, 2013, a glacial lake burst above Kedarnath. The 1200-year-old temple remained standing—protected by a massive boulder that appeared directly behind it, splitting the floodwaters around the structure like a divine shield. Scientists confirmed the boulder was deposited 16,000 years ago by ancient glacial activity, silently waiting. Devotees call it 'Bhim Shila'—the rock Bhima placed to protect Shiva. The temple's survival is a testament to divine protection and ancient engineering wisdom.",
        "source": "GSI Reports 2013",
        "image": "data/temples/kedarnath/images/kedar_2013_flood.png",
        "verified": true
    },
    {
        "id": "shankaracharya",
        "category": "History",
        "title": "Adi Shankaracharya's Sacred Legacy",
        "hook": "The greatest philosopher of Hindu India chose this sacred peak for his mahasamadhi",
        "full_story": "Adi Shankaracharya, who unified Hindu philosophy and established temples across India in the 8th century CE, built the current Kedarnath temple. According to tradition, at age 32, having completed his divine mission of reviving Sanatan Dharma, he walked behind the temple toward the Chorabari Glacier and attained Mahasamadhi—conscious union with the divine. A small shrine marks his sacred departure point. The temple's massive interlocking stone construction—requiring no mortar—represents wisdom far ahead of its time.",
        "source": "Shankaracharya biographies, Temple records",
        "image": "data/temples/kedarnath/images/kedar_shankaracharya.png",
        "verified": true
    },
    {
        "id": "closed",
        "category": "Tradition",
        "title": "Six Months of Divine Rest",
        "hook": "In winter, Shiva rests in the snows while the sacred flame journeys to Ukhimath",
        "full_story": "Each November on Bhai Dooj, the temple closes for 6 months. The priests carry the sacred eternal flame in a blessed procession to Ukhimath village 16 km away, where the deity rests during winter. The temple becomes inaccessible under 20+ feet of snowfall. Remarkably, when the temple opens in May, it's often found perfectly preserved—sometimes with oil lamps still burning inside. The divine presence remains in the snows, tending the shrine during the closed season.",
        "source": "Temple tradition, Priest testimony",
        "image": "data/temples/kedarnath/images/kedar_winter_temple.png",
        "verified": true
    },
    {
        "id": "architecture",
        "category": "Architecture",
        "title": "Ancient Engineering Marvel",
        "hook": "Built without mortar, yet surviving earthquakes and floods for 1200 years",
        "full_story": "The Kedarnath temple is an engineering wonder. Massive grey stone slabs, some weighing several tonnes, are fitted together with interlocking joints—no mortar, no cement. The structure sits directly on bare rock. Yet it has survived: 8+ magnitude earthquakes, annual avalanche pressure, extreme freeze-thaw cycles, and the 2013 mega-flood. Modern structural engineers confirm the design is more resilient than contemporary construction. The interlocking method allows stones to shift slightly during earthquakes and resettle—preventing damage. This was either 8th-century genius or inherited from even older wisdom.",
        "source": "ASI architectural analysis, IIT studies",
        "image": "data/temples/kedarnath/images/kedar_temple_sunrise.png",
        "verified": true
    },
    {
        "id": "panch",
        "category": "Pilgrimage",
        "title": "Panch Kedar: The Sacred Circuit",
        "hook": "One divine buffalo. Five body parts. Five temples across 170 km of Himalayan wilderness.",
        "full_story": "The full Panch Kedar yatra covers all five temples where Shiva's buffalo form emerged: Kedarnath (hump), Madmaheshwar (navel, 3497m), Tungnath (arms, 3680m—world's highest Shiva temple), Rudranath (face, 3600m), and Kalpeshwar (hair, 2200m—accessible in winter). The complete circuit requires 15-20 days of trekking through spectacular Himalayan terrain. Completing all five is considered a lifetime achievement by devout Shaivites. For those who complete this sacred journey, tradition says Shiva grants whatever their heart desires—the pilgrimage itself has proven their devotion.",
        "source": "Garhwal pilgrimage traditions",
        "image": "data/temples/kedarnath/images/kedar_trek_pilgrims.png",
        "verified": true
    }
]