[
    {
        "id": "origin",
        "category": "Legend",
        "title": "The Lord Who Conquered Time",
        "hook": "Shiva emerged as a pillar of infinite light to vanquish the demon Dushana and protect Ujjain",
        "full_story": "According to the Shiva Purana, a demon named Dushana terrorized Ujjain and its devotees. When the righteous King Chandrasena prayed intensely to Shiva, the Lord manifested as Mahakal—the one beyond time—and destroyed the demon with his divine fire. Shiva then agreed to permanently reside here as Mahakaleshwar, protecting all devotees from the fear of death and time. The name Mahakal means 'Great Time' or 'Beyond Death.'",
        "source": "Shiva Purana, Avanti Khanda",
        "image": "data/temples/mahakaleshwar/images/hero.png",
        "verified": true
    },
    {
        "id": "bhasma",
        "category": "Tradition",
        "title": "The Sacred Bhasma Aarti",
        "hook": "The only temple where cremation ashes are applied to the Shivalinga at 4 AM daily",
        "full_story": "The Bhasma Aarti at Mahakaleshwar is one of Hinduism's most powerful rituals. Performed at 4 AM daily, priests apply sacred ash (bhasma) to the Shivalinga while chanting Vedic mantras. The ash symbolizes the ultimate truth—that everything material reduces to ash, while the soul is eternal. Witnessing this aarti is said to cleanse accumulated karma and grant spiritual awakening. The electric atmosphere with damru and conch sounds creates an unforgettable spiritual experience.",
        "source": "Temple traditions, Shiva Purana",
        "image": "data/temples/mahakaleshwar/images/thumbnail.png",
        "verified": true
    },
    {
        "id": "dakshina",
        "category": "Mystery",
        "title": "The Only South-Facing Jyotirlinga",
        "hook": "Mahakal faces south—the direction of death—because he conquers it",
        "full_story": "Among all 12 Jyotirlingas, only Mahakaleshwar faces south (Dakshinamurti form). In Hindu tradition, south is the direction of Yama, the god of death. By facing south, Mahakal demonstrates his supremacy over death itself. Devotees who worship here are said to be freed from the fear of death. This unique positioning is not accidental but represents profound cosmic symbolism—the Lord who faces death and transcends it.",
        "source": "Tantric traditions, Shiva Purana",
        "image": "data/temples/mahakaleshwar/images/hero.png",
        "verified": true
    },
    {
        "id": "architecture",
        "category": "Architecture",
        "title": "The Five-Level Sacred Complex",
        "hook": "Descend underground to meet the Lord of Time in his cave-like sanctum",
        "full_story": "The Mahakaleshwar temple complex is built on three levels—the ground, basement, and sub-basement. The main Jyotirlinga is in the lowest level (garbhagriha), creating a cave-like atmosphere that enhances the mystical experience. Above it sit the Omkareshwar and Nagchandreshwar temples. The Nagchandreshwar deity is opened only once a year on Nag Panchami. The Maratha-era architecture features intricate silver doors and ornate pillars.",
        "source": "Archaeological Survey of India",
        "image": "data/temples/mahakaleshwar/images/thumbnail.png",
        "verified": true
    },
    {
        "id": "kshipra",
        "category": "Pilgrimage",
        "title": "Simhastha Kumbh on the Shipra",
        "hook": "Every 12 years, millions gather for the Kumbh Mela at Mahakal's sacred river",
        "full_story": "The Shipra River flows through Ujjain, and on its banks the Simhastha Kumbh Mela is held every 12 years when Jupiter enters Leo. This is one of the four Kumbh sites where nectar (amrit) fell from the pot carried by Vishnu. Millions of pilgrims take sacred dips in the Shipra and visit Mahakaleshwar. The combination of Kumbh bathing and Mahakal darshan is considered extraordinarily purifying, granting immense spiritual merit.",
        "source": "Puranic traditions, Kumbh Mela records",
        "image": "data/temples/mahakaleshwar/images/hero.png",
        "verified": true
    },
    {
        "id": "experience",
        "category": "Experience",
        "title": "The Mahakal Corridor Walk",
        "hook": "Walk the newly built 900-meter spiritual corridor telling the story of Shiva",
        "full_story": "The recently completed Mahakal Lok corridor stretches 900 meters from the Rudrasagar Lake to the temple. Lined with 108 pillars depicting stories from Shiva Purana, bronze murals of Shiva's divine plays, and musical fountains, this corridor transforms the pilgrimage into an immersive spiritual journey. The evening light-and-sound show brings the legends of Mahakal to life, making the approach to the temple as memorable as the darshan itself.",
        "source": "Mahakal Temple Trust, Government records",
        "image": "data/temples/mahakaleshwar/images/thumbnail.png",
        "verified": true
    }
]