{
    "name": "Vishwanatha",
    "meaning": "Lord of the Universe",
    "other_names": [
        "Vishweshwara",
        "Kashi Natha",
        "Baba Vishwanath",
        "Jyotirlinga"
    ],
    "epithets": [
        "Mahadeva - The Great God",
        "Neelakantha - The Blue-Throated One",
        "Nataraja - The Cosmic Dancer",
        "Pashupati - Lord of All Beings",
        "Mahakala - Lord of Time",
        "Ardhanarishwara - Half-Woman Lord"
    ],
    "iconography": {
        "form_here": "At Kashi, Shiva is worshipped as a Jyotirlinga—a column of light/fire, rather than an anthropomorphic form. The small black stone Lingam represents the infinite pillar that has no beginning or end.",
        "symbolism": {
            "lingam": "Not phallic—represents the formless Brahman (ultimate reality) taking form",
            "yoni_base": "Shakti/Prakriti—the feminine creative energy from which form emerges",
            "bilva_leaves": "Three leaves = three gunas (qualities of nature)",
            "serpent": "Kundalini energy; also represents time/cycles",
            "ganga_on_head": "Absorption of cosmic energy; also the myth of catching falling Ganga",
            "third_eye": "Inner wisdom; also the fire that destroys illusion",
            "trishul": "Three functions: creation, preservation, destruction"
        },
        "abhishek_items": {
            "milk": "Purity, calmness",
            "honey": "Sweet speech, harmony",
            "curd": "Prosperity",
            "ghee": "Victory, spiritual progress",
            "gangajal": "Purification of the soul"
        }
    },
    "mythology": {
        "origin_story": "When the universe was still unmanifest void, Shiva's Jyotirlinga spontaneously emerged at Kashi. Before the Ganga flowed, before the Himalayas rose, Kashi existed as a point of pure consciousness. When Brahma began creation, he asked Shiva where to establish righteousness—Shiva struck his Trishul into the ground and Kashi manifested around its tip.",
        "key_episodes": [
            {
                "title": "Shiva and Parvati's Eternal Home",
                "story": "After wandering all creation, Shiva chose Kashi as his permanent home. He promised never to leave it—hence the name 'Avimukta' (the never-forsaken). Parvati joins him as Annapurna, feeding all who come."
            },
            {
                "title": "The Curse on Brahma",
                "story": "When Brahma lied about finding the end of the Jyotirlinga, Shiva cursed him to never be worshipped in temples. This is why there are hardly any Brahma temples in India despite him being the creator."
            },
            {
                "title": "Shiva as Bhairava",
                "story": "In Kashi, Shiva's fierce form Kalabhairava serves as the Kotwal (guardian/policeman) of the city. All souls entering Kashi must pass Bhairava's judgment. Visiting Kal Bhairav temple is essential before Vishwanath."
            }
        ]
    },
    "worship": {
        "primary_mantra": {
            "sanskrit": "ॐ नमः शिवाय",
            "transliteration": "Om Namah Shivaya",
            "translation": "I bow to Shiva / I honor the auspicious one",
            "meaning": "The Panchakshari (five-syllable) mantra. Na-Ma-Shi-Va-Ya represent the five elements and five actions of Shiva. Chanting purifies all karma."
        },
        "taraka_mantra": {
            "context": "The secret mantra Shiva whispers to dying souls in Kashi",
            "teaching": "The soul realizes its identity with the infinite at the moment of death, breaking all bonds"
        },
        "offerings": [
            "Bilva leaves (sacred to Shiva)",
            "White flowers (purity)",
            "Bhasma (sacred ash)",
            "Bhang (cannabis) - traditional but regulated",
            "Raw milk",
            "Gangajal"
        ],
        "festivals": [
            {
                "name": "Maha Shivaratri",
                "timing": "February/March (Phalguna)",
                "significance": "Night Shiva performed the Tandava (cosmic dance). All-night worship, massive crowds."
            },
            {
                "name": "Shravan Month",
                "timing": "July/August",
                "significance": "Holiest month for Shiva worship. Millions of Kanwarias walk from Haridwar with Ganga water."
            },
            {
                "name": "Dev Deepawali",
                "timing": "15 days after Diwali",
                "significance": "Gods descend to Kashi. All ghats lit with millions of diyas. Spectacular."
            }
        ]
    },
    "philosophy": {
        "core_teaching": "Shiva represents pure consciousness (Chit)—the witness that observes all experience but is not touched by it. He is both the destroyer (of ego, illusion, ignorance) and the liberator. At Kashi, he teaches that death is not an ending but a doorway.",
        "meditation_practice": "Sit at Manikarnika Ghat watching cremations. Contemplate: 'This body will burn. What remains? Who is watching?' This is Shiva's teaching at Kashi—direct confrontation with impermanence to discover what is permanent.",
        "tantra_connection": "Kashi is a major center of Tantric practice. Shiva as Bhairava and Shakti as Kali are worshipped in their fierce forms. The cremation grounds are considered most auspicious for Tantric sadhana."
    }
}