[
    {
        "id": "origin",
        "category": "Origin",
        "title": "The Infinite Pillar of Light",
        "hook": "How a cosmic argument between Brahma and Vishnu created the holiest site on Earth",
        "full_story": "According to the Shiva Purana, Brahma and Vishnu once argued over who was supreme. To settle the dispute, Shiva manifested as an endless column of fire—the first Jyotirlinga—challenging both to find its ends. Brahma flew upward for eons and lied about reaching the top. Vishnu descended honestly and admitted the pillar was infinite. Pleased with Vishnu's humility, Shiva cursed Brahma to never be worshipped in temples. Kashi marks the spot where this column first touched Earth, making it eternally sacred.",
        "source": "Shiva Purana, Vidyeshwara Samhita",
        "image": "data/temples/kashi-vishwanath/images/origin.png",
        "verified": true
    },
    {
        "id": "gyanvapi",
        "category": "History",
        "title": "The Gyanvapi Mystery",
        "hook": "The original Shivalinga may still be hidden in a well right next to the mosque",
        "full_story": "In 1669, Mughal Emperor Aurangzeb ordered the destruction of the original Vishwanath temple. According to temple records, the head priest Pujari Ram grabbed the sacred Swayambhu Lingam and jumped into the adjacent well—Gyanvapi (Well of Wisdom)—to save it from desecration. Aurangzeb built a mosque using the temple's foundation and walls, which still stand today. In 2022, a court-ordered survey found a Shivalinga-like structure in the mosque's wudu fountain. The matter remains in legal dispute, but for devotees, the original manifestation of Shiva never left Kashi.",
        "source": "Temple records, ASI Survey 2022",
        "image": "data/temples/kashi-vishwanath/images/gyanvapi.png",
        "verified": true
    },
    {
        "id": "moksha",
        "category": "Philosophy",
        "title": "Moksha: Liberation Through Death",
        "hook": "The only place where death is considered a blessing, not a tragedy",
        "full_story": "Hindu tradition holds that dying in Kashi grants instant Moksha—liberation from the cycle of rebirth. This isn't superstition but theology: Kashi is believed to exist on Shiva's Trishul, outside the normal universe. When someone dies here, Shiva himself whispers the Taraka Mantra (sacred death chant) into their right ear. This is why elderly Hindus have come to Kashi to die for millennia. The Manikarnika Ghat has cremation fires burning 24/7, processing 200+ bodies daily. Far from morbid, it's considered the most auspicious site in Hinduism.",
        "source": "Kashi Khanda, Skanda Purana",
        "image": "data/temples/kashi-vishwanath/images/moksha.png",
        "verified": true
    },
    {
        "id": "reconstruction",
        "category": "History",
        "title": "Destroyed & Rebuilt 6 Times",
        "hook": "Every invader tried to erase it. Every generation rebuilt it.",
        "full_story": "The Kashi Vishwanath temple has been destroyed at least 6 times: by Qutb-ud-din Aibak (1194), Hussain Shah Sharqi (1447), Akbar's general (1585), and most famously by Aurangzeb (1669). Each time, devotees rebuilt it. The current temple was constructed by Queen Ahilyabai Holkar of Indore in 1780 at a new site nearby. Maharaja Ranjit Singh donated 820 kg of gold for the dome in 1839. In 2021, PM Modi inaugurated the Kashi Vishwanath Corridor, a ₹339 crore project connecting the temple directly to the Ganga—the largest transformation in 200 years.",
        "source": "Historical records, ASI",
        "image": "data/temples/kashi-vishwanath/images/reconstruction.png",
        "verified": true
    },
    {
        "id": "trishul",
        "category": "Legend",
        "title": "The City on Shiva's Trident",
        "hook": "Kashi exists outside the universe—it survives even cosmic destruction",
        "full_story": "According to the Kashi Khanda, Varanasi is not part of Earth—it rests on the tip of Shiva's Trishul (trident), held above the physical world. During Pralaya (cosmic dissolution), when Brahma, Vishnu, and all creation are absorbed back into the void, Kashi alone survives. Shiva lifts it on his trident and holds it until the next cycle of creation begins. This is why Kashi is called 'Avimukta'—the place Shiva never abandons. For pilgrims, stepping into Kashi means stepping outside the cycle of birth and death.",
        "source": "Kashi Khanda, Skanda Purana",
        "image": "data/temples/kashi-vishwanath/images/trishul.png",
        "verified": true
    },
    {
        "id": "panchtirthi",
        "category": "Ritual",
        "title": "The Five Sacred Crossings",
        "hook": "Complete this pilgrimage circuit and your sins are washed forever",
        "full_story": "The Panch Tirthi Yatra is the most sacred pilgrimage within Kashi: five ghats that must be visited in order, bathing at each. Start at Asi Ghat (where the Asi river meets Ganga), proceed to Dashashwamedh (where Brahma performed 10 horse sacrifices), then Manikarnika (the primordial cremation ground), Panchganga (confluence of 5 rivers), and finally Adi Keshava (where Vishnu's feet first touched Earth). Completing this circuit barefoot in a single day, while fasting, is said to wash away sins accumulated over 100 lifetimes.",
        "source": "Kashi Mahatmya traditions",
        "image": "data/temples/kashi-vishwanath/images/panchtirthi.png",
        "verified": true
    }
]