[
    {
        "id": "supriya",
        "category": "Legend",
        "title": "Supriya's Devotion Defeats Daruka",
        "hook": "A devoted merchant imprisoned by a demon called upon Shiva and won liberation for all",
        "full_story": "The Shiva Purana tells of Daruka, a demon who captured many people including a Shiva devotee named Supriya. Even in prison, Supriya continued his worship, converting other prisoners to Shiva devotion. Enraged, Daruka came to kill them all. Supriya prayed intensely, and Shiva emerged from the earth as a Jyotirlinga, destroying Daruka with his divine weapons. Shiva then remained as Nageshwar to bless all devotees.",
        "source": "Shiva Purana",
        "image": "data/temples/nageshwar/images/hero.png",
        "verified": true
    },
    {
        "id": "shiva_statue",
        "category": "Architecture",
        "title": "The 82-foot Shiva Statue",
        "hook": "A towering bronze Shiva statue welcomes pilgrims from miles away",
        "full_story": "Near the temple stands an 82-foot tall bronze statue of Lord Shiva in meditation—one of the largest Shiva statues in India. This modern addition has become an iconic landmark visible from great distances. Pilgrims often stop here first for photo darshan before proceeding to the ancient Jyotirlinga. The statue's serene expression captures Shiva's meditative peace.",
        "source": "Temple records",
        "image": "data/temples/nageshwar/images/thumbnail.png",
        "verified": true
    },
    {
        "id": "dwarka",
        "category": "Pilgrimage",
        "title": "Part of the Sacred Dwarka Circuit",
        "hook": "Combine with Char Dham Dwarkadhish for a complete pilgrimage experience",
        "full_story": "Nageshwar is located just 17 km from Dwarkadhish Temple, one of the four Char Dham sites. Pilgrims traditionally visit both temples on the same journey, receiving blessings from both Shiva and Krishna in Lord Krishna's sacred city. This combination of Jyotirlinga darshan and Char Dham yatra makes the journey doubly meritorious.",
        "source": "Pilgrimage traditions",
        "image": "data/temples/nageshwar/images/hero.png",
        "verified": true
    },
    {
        "id": "protection",
        "category": "Significance",
        "title": "Protection from Snake-Related Fears",
        "hook": "The Lord of Serpents protects devotees from all serpent-related dangers and fears",
        "full_story": "Nageshwar means 'Lord of Nagas (Serpents).' Shiva is depicted with serpents as sacred ornaments, representing his mastery over fear and death. Devotees pray here for protection from snake bites, Kaal Sarpa Dosh (astrological affliction), and all serpent-related fears. The serpent also symbolizes kundalini energy—worshipping Nageshwar is believed to aid in spiritual awakening.",
        "source": "Tantric traditions, Shiva Purana",
        "image": "data/temples/nageshwar/images/thumbnail.png",
        "verified": true
    },
    {
        "id": "puja",
        "category": "Tradition",
        "title": "Nageshwar Abhishek Rituals",
        "hook": "Special pujas available for devotees to personally worship the Jyotirlinga",
        "full_story": "Nageshwar temple offers various pujas for devotees to participate in worship. The Laghu Rudrabhishek and Maha Rudrabhishek ceremonies allow devotees to pour sacred substances over the Jyotirlinga while Vedic mantras are chanted. These intimate worship opportunities are relatively accessible here compared to more crowded Jyotirlingas, making Nageshwar popular for those seeking personal, unhurried darshan.",
        "source": "Temple Trust",
        "image": "data/temples/nageshwar/images/hero.png",
        "verified": true
    },
    {
        "id": "sunset",
        "category": "Experience",
        "title": "Coastal Spirituality at Sunset",
        "hook": "Watch the sun set over the Arabian Sea after your darshan",
        "full_story": "Located near the Gujarat coastline, Nageshwar offers pilgrims the unique experience of combining temple darshan with the spectacular Arabian Sea sunset. The evening aarti coincides with sunset during much of the year. Many devotees describe the combination of divine darshan and the golden ocean sunset as one of the most moving spiritual experiences of their pilgrimage.",
        "source": "Pilgrim accounts",
        "image": "data/temples/nageshwar/images/thumbnail.png",
        "verified": true
    }
]