[
    {
        "id": "kartikeya",
        "title": "The Conflict of Divine Sons",
        "subtitle": "Why Shiva and Parvati Reside at Srisailam",
        "category": "Puranic Origin",
        "source": "Shiva Purana, Skanda Purana",
        "image": "data/temples/mallikarjuna/images/kartikeya_legend.png",
        "summary": "The cosmic family dispute that brought Shiva and Parvati to this mountain.",
        "full_story": "When Ganesha and Kartikeya both reached marriageable age, they disagreed about who should marry first. Shiva and Parvati proposed a test: whoever could circumambulate the entire world first would win. Kartikeya, confident in his swift peacock mount, immediately set off around the globe. Ganesha, with his humble mouse, consulted the Shastras which declare that one's parents embody the entire universe. He simply walked seven times around Shiva and Parvati with deep devotion.\n\nWhen Ganesha cited scriptural authority for his act, Shiva and Parvati declared him the winner and celebrated his marriage to Buddhi (Intellect), Siddhi (Spiritual Power), and Riddhi (Prosperity). Kartikeya returned after circling the earth only to find he had lost. Overcome with rage and betrayal, he renounced his family, vowed to remain a bachelor (Kumara Brahmachari), and retreated to the Krauncha Mountain—the Srisailam range.\n\nDesolate at the separation from their beloved son, Shiva and Parvati followed him. But respecting his desire for solitude, they chose to reside nearby in the forms of Mallikarjuna and Bhramaramba. The texts say Shiva visits Kartikeya on Amavasya (New Moon) to soothe his anger, while Parvati visits on Poornima (Full Moon).",
        "spiritual_significance": "This legend reveals Srisailam as a place sanctified by divine parental love. It teaches that true wisdom (Ganesha's approach) transcends mere physical effort. The site embodies the tension between worldly accomplishment and spiritual devotion.",
        "pilgrimage_reflection": "As you stand before Mallikarjuna, remember: you are in the presence of divine parents who came here for love of their child. They await all their children's return."
    },
    {
        "id": "chandravati",
        "title": "Princess Chandravati and the Jasmine Garlands",
        "subtitle": "The Origin of the Name 'Mallikarjuna'",
        "category": "Sthala Purana",
        "source": "Srisailam Sthala Purana",
        "image": "data/temples/mallikarjuna/images/chandravati.png",
        "summary": "How simple devotion with wild jasmine flowers pleased the Lord.",
        "full_story": "Princess Chandravati, daughter of King Chandragupta, fled her palace due to an unwanted marriage and sought refuge in the dense forests of Srisailam. Adopting ascetic life, she lived on wild fruits and the milk of her cows.\n\nOne day, she noticed a strange phenomenon: one of her black cows would wander to a secluded spot under a bilva tree and spontaneously release its milk onto a black rock. Investigating, Chandravati discovered the rock was a Swayambhu (self-manifested) Shiva Linga.\n\nOvercome with devotion, she began daily worship. Lacking formal ritual items, she fashioned garlands from the abundant wild jasmine (Mallika) flowers of the forest and offered them with pure love.\n\nOne night, Lord Shiva appeared in her dream. Pleased with her simple but profound devotion, he declared: 'Since you have worshipped me with Mallika flowers, I shall henceforth be known as Mallikarjuna—the Lord adorned with Jasmine.'",
        "spiritual_significance": "This story celebrates the Bhakti tradition—sincere devotion matters more than elaborate rituals. The Mallika (jasmine), white and fragrant, symbolizes purity and the offering of one's sweetest essence to the divine.",
        "pilgrimage_reflection": "Offer your worship with the simplicity and purity of Chandravati. Even a single flower given with love reaches the Lord."
    },
    {
        "id": "bhramaramba",
        "title": "Bhramaramba: The Mother of Bees",
        "subtitle": "How Shakti Destroyed Arunasura",
        "category": "Devi Mahatmya",
        "source": "Shakti Purana, Devi Mahatmya",
        "image": "data/temples/mallikarjuna/images/bhramaramba.png",
        "summary": "The Goddess manifested as a swarm of bees to destroy an invincible demon.",
        "full_story": "The demon Arunasura performed intense penance and received a boon from Lord Brahma making him immune to death by any two-legged or four-legged creature. Armed with this near-immortality, he terrorized the three worlds, disrupting Vedic rituals and tormenting the Devas.\n\nThe gods approached Adi Shakti for protection. The Goddess, perceiving the loophole in the demon's boon, engaged him in battle. Rather than taking human or animal form, she released from her divine body thousands of six-legged black bees (Bhramara).\n\nThese bees swarmed Arunasura, stinging him relentlessly. Since bees are six-legged creatures, the boon's conditions remained unviolated, and the demon was destroyed.\n\nVictorious, the Goddess chose to reside at Srisailam in her form as Bhramaramba—'The Mother of Bees.' Devotees say that a subtle buzzing sound, like the hum of bees, can still be heard in the inner sanctum by those with pure hearts.",
        "spiritual_significance": "Bhramaramba represents the protective, fierce aspect of the Divine Mother. The bee symbolism connects to yogic traditions—the buzzing sound (Bhramari) corresponds to the vibration experienced at the Ajna Chakra during meditation.",
        "pilgrimage_reflection": "Approach Bhramaramba knowing she protects her devotees from every form of evil, finding creative ways to overcome even the most impossible obstacles."
    },
    {
        "id": "chenchu",
        "title": "Shiva's Tribal Marriage: The Chenchu Connection",
        "subtitle": "How Mallikarjuna Became the Son-in-Law of the Forest Tribe",
        "category": "Tribal Folklore",
        "source": "Chenchu Oral Tradition",
        "image": "data/temples/mallikarjuna/images/chenchu_mallayya.png",
        "summary": "The divine marriage that grants special rights to the indigenous Chenchu tribe.",
        "full_story": "According to Chenchu tribal folklore, Lord Shiva came to the Nallamala forest disguised as a hunter. There, he encountered a beautiful Chenchu woman—some say a manifestation of Parvati herself, others say a devoted tribal woman named Chenchu Lakshmi.\n\nCaptivated by her beauty and the simple life of the forest people, Shiva married her and settled among the tribe. Because of this marriage, the Chenchu tribespeople consider Lord Mallikarjuna to be their son-in-law (alludu) and affectionately call him Chenchu Mallayya.\n\nThis kinship grants the Chenchu people traditional rights denied to other castes:\n• Entry into the sanctum during specific rituals\n• The right to perform Sparsha Darshan (touching the Linga)\n• The privilege of dragging the temple chariot during festivals\n\nDuring Ugadi, Chenchu devotees walk hundreds of kilometers carrying decorated Nandi Kamba (poles) to offer to their 'son-in-law.'",
        "spiritual_significance": "This legend represents the integration of indigenous forest traditions into mainstream Hindu practice. It demonstrates that the divine is not bound by caste or social hierarchy—Shiva himself chose a tribal woman as his bride.",
        "pilgrimage_reflection": "The God of the universe married into a simple forest tribe. Srisailam teaches that devotion, not social status, opens the door to the divine."
    },
    {
        "id": "kartikeya_visits",
        "title": "The Moon Visits: Amavasya and Poornima",
        "subtitle": "Why Parents Visit on New Moon and Full Moon",
        "category": "Ritual Significance",
        "source": "Shiva Purana",
        "image": "data/temples/mallikarjuna/images/moon_visits.png",
        "summary": "The cosmic schedule of divine family reconciliation.",
        "full_story": "After the conflict over marriage, Kartikeya retreated to Krauncha Mountain (Srisailam). Though Shiva and Parvati followed him out of love, they respected his need for distance.\n\nAccording to tradition:\n• On every Amavasya (New Moon), Shiva visits Kartikeya to soothe his anger\n• On every Poornima (Full Moon), Parvati visits her son on the mountain\n\nThese visits continue for eternity, a cosmic reconciliation that never fully completes. The New Moon represents Shiva—the dark, transcendent consciousness. The Full Moon represents Parvati—the luminous, manifest shakti.\n\nPilgrims who visit on these days are said to witness the subtle reunion of the divine family and receive special blessings for family harmony.",
        "spiritual_significance": "This legend grounds the lunar calendar in family dharma. It teaches that parental love persists despite conflict, and reconciliation is an ongoing, eternal process.",
        "pilgrimage_reflection": "Visit on Amavasya or Poornima to participate in the cosmic family reunion. Pray for healing of any divisions in your own family."
    }
]