[
    {
        "id": "ghushma",
        "category": "Legend",
        "title": "Ghushma's Unwavering Devotion",
        "hook": "A devoted wife made 101 Shivalingas daily despite persecution—Shiva finally manifested for her",
        "full_story": "The Shiva Purana tells of Ghushma, wife of Sudhama, who daily crafted a Shivalinga, worshipped it, and immersed it in a nearby lake. Her stepmother-in-law, jealous of her devotion, killed her son. When Ghushma continued her practice without losing faith, Shiva was so moved that he appeared, restored her son to life, and offered to destroy her tormentor. Ghushma asked for forgiveness for her enemy instead. Pleased by her compassion, Shiva remained as Grishneshwar—the Lord of Compassion.",
        "source": "Shiva Purana",
        "image": "data/temples/grishneshwar/images/hero.png",
        "verified": true
    },
    {
        "id": "ellora",
        "category": "Pilgrimage",
        "title": "Gateway to Ellora's Sacred Caves",
        "hook": "Combine your darshan with a visit to the UNESCO World Heritage Ellora Caves",
        "full_story": "Grishneshwar is located just 1 km from the magnificent Ellora Caves—a UNESCO World Heritage Site featuring 34 rock-cut temples spanning Buddhist, Hindu, and Jain traditions carved between the 6th and 11th centuries. The Kailasa Temple at Ellora, dedicated to Shiva, is the largest monolithic rock excavation in the world. Pilgrims traditionally visit both the Jyotirlinga and these ancient rock temples for a complete spiritual and cultural experience.",
        "source": "UNESCO, ASI records",
        "image": "data/temples/grishneshwar/images/thumbnail.png",
        "verified": true
    },
    {
        "id": "ahilyabai",
        "category": "History",
        "title": "Ahilyabai Holkar's Gift to India",
        "hook": "The legendary queen rebuilt multiple Jyotirlingas including this one",
        "full_story": "The current Grishneshwar temple was built in the 18th century by Ahilyabai Holkar, the legendary Maratha queen of Indore. She is renowned for rebuilding Hindu temples across India that had been damaged, including work at Kashi, Srisailam, and here. The red stone temple features elegant Maratha architecture and is a testament to her devotion. She considered herself merely a servant of Shiva, rebuilding his homes.",
        "source": "Historical records, Holkar archives",
        "image": "data/temples/grishneshwar/images/hero.png",
        "verified": true
    },
    {
        "id": "architecture",
        "category": "Architecture",
        "title": "Compact Maratha Elegance",
        "hook": "The smallest Jyotirlinga temple proves that divine power isn't measured in size",
        "full_story": "Grishneshwar is the smallest of the 12 Jyotirlinga temples, yet its compact size concentrates spiritual energy remarkably. Built in red stone, the temple features intricate carvings of Shiva's legends, five-tiered shikhara, and an intimate inner sanctum. The smaller scale allows for a more personal darshan experience—devotees often feel an intense connection here that larger temples may not provide.",
        "source": "Temple studies",
        "image": "data/temples/grishneshwar/images/thumbnail.png",
        "verified": true
    },
    {
        "id": "completion",
        "category": "Significance",
        "title": "Completing the Dwadash Jyotirlinga",
        "hook": "The twelfth Jyotirlinga—completing this pilgrimage grants exceptional spiritual merit",
        "full_story": "Grishneshwar is numbered the 12th Jyotirlinga, making it the final destination for those completing the Dwadash (twelve) Jyotirlinga yatra. According to the Shiva Purana, those who visit all twelve Jyotirlingas attain moksha. Pilgrims who have journeyed across India to complete this sacred circuit often experience deep emotion upon reaching Grishneshwar—the culmination of their spiritual quest.",
        "source": "Shiva Purana, pilgrimage traditions",
        "image": "data/temples/grishneshwar/images/hero.png",
        "verified": true
    },
    {
        "id": "compassion",
        "category": "Tradition",
        "title": "The Jyotirlinga of Forgiveness",
        "hook": "Ghushma asked Shiva to forgive her persecutor—this temple embodiess divine mercy",
        "full_story": "Unlike other Jyotirlingas associated with victory or power, Grishneshwar's founding legend centers on forgiveness. When offered any boon, Ghushma asked for mercy for the stepmother who had tormented her. This makes Grishneshwar the Jyotirlinga of compassion. Devotees come here specifically to pray for the ability to forgive, to seek reconciliation, and to release grudges. The energy here is notably gentle.",
        "source": "Temple traditions",
        "image": "data/temples/grishneshwar/images/thumbnail.png",
        "verified": true
    }
]