[
    {
        "id": "debt",
        "category": "Legend",
        "title": "The Sacred Loan of the Divine",
        "hook": "Vishnu's cosmic agreement with Kubera—every donation helps repay the divine debt",
        "full_story": "According to temple tradition, when Lord Vishnu descended as Venkateswara to marry the beautiful Padmavati, he needed funds for the divine wedding. He borrowed from Kubera, the God of Wealth, creating a sacred agreement that devotees' offerings would repay this cosmic debt until the end of Kaliyuga. Every donation you make participates in this divine transaction. The temple symbolically maintains records of this sacred balance, connecting each devotee to this eternal story of divine love and devotion.",
        "source": "Tirumala Temple tradition, Venkatachala Mahatmyam",
        "image": "data/temples/tirupati/images/tirupati_golden_vimana.png",
        "verified": true
    },
    {
        "id": "hair",
        "category": "Tradition",
        "title": "Sacred Hair Offering",
        "hook": "The world's largest act of devotional surrender—500 tonnes of sacred offerings annually",
        "full_story": "Tirumala witnesses the world's largest devotional hair offering, with over 500 tonnes collected annually. This tradition began when a celestial princess named Neela Devi offered her divine locks to restore beauty to the Lord's form. In gratitude, Lord Venkateswara declared that devotees' hair offerings would forever be accepted as sacred gifts. Today, this act of ego-surrender is performed by 20,000 devotees daily at the dedicated Kalyana Katta, each offering symbolizing their devotion and humility before the Lord.",
        "source": "TTD Annual Report, Sthala Purana",
        "image": "data/temples/tirupati/images/tirupati_devotees_queue.png",
        "verified": true
    },
    {
        "id": "wealth",
        "category": "Economy",
        "title": "Temple of Sacred Charity",
        "hook": "₹3,500 crore annual offerings—transformed entirely into service to humanity",
        "full_story": "Tirumala's annual offerings of over ₹3,500 crore make it the world's wealthiest temple. But what makes this truly remarkable is how every rupee is dedicated to seva: The temple runs 35 free hospitals serving millions, 150+ schools providing free education, and the legendary Nitya Annadanam feeding 3 lakh pilgrims daily for free. The TTD (Tirumala Tirupati Devasthanams) is India's largest charitable trust, transforming devotees' offerings into blessings for humanity.",
        "source": "TTD Financial Statements 2023",
        "image": "data/temples/tirupati/images/tirupati_golden_vimana.png",
        "verified": true
    },
    {
        "id": "idol",
        "category": "Mystery",
        "title": "The Self-Manifested Deity",
        "hook": "A 6-foot Swayambhu form that stands without any visible support—a divine mystery",
        "full_story": "The magnificent 6-foot deity of Sri Venkateswara is unique among Hindu temples: carved from black granite, it appears to stand freely without any pedestal or support structure. Temple tradition holds that this is a Swayambhu manifestation—self-emerged rather than sculpted by human hands. The smooth, lustrous black surface is maintained through daily Abhishekam with sacred substances. Scientists and devotees alike marvel at this divine form, which has inspired devotion for over a millennium.",
        "source": "Temple records, ASI studies",
        "image": "data/temples/tirupati/images/tirupati_balaji_darshan.png",
        "verified": true
    },
    {
        "id": "darshan",
        "category": "Experience",
        "title": "The Precious Moment of Darshan",
        "hook": "Hours of devoted chanting culminate in a life-transforming glimpse of the Lord",
        "full_story": "The journey to Balaji's darshan is itself a spiritual practice. As devotees wait, they join the collective chorus of 'Govinda! Govinda!', their voices merging with lakhs of fellow pilgrims. The anticipation builds with each step closer to the sanctum. Then—the moment arrives. Though brief, devotees describe this glimpse of the Lord's divine form as transformative, carrying blessings that last a lifetime. Many say: 'One glance from Balaji is worth a hundred lifetimes of merit.'",
        "source": "Pilgrim testimonies, TTD records",
        "image": "data/temples/tirupati/images/tirupati_devotees_queue.png",
        "verified": true
    },
    {
        "id": "eyeclosed",
        "category": "Mystery",
        "title": "The Divine Eyes of Balaji",
        "hook": "A sacred mystery—the Lord's eyes appear differently to different devotees",
        "full_story": "One of Tirupati's most contemplated mysteries: Lord Balaji's eyes appear differently to different devotees. Some see them fully open, radiating grace and blessing. Others perceive them half-closed in cosmic meditation. Temple tradition says the eyes reflect the devotee's own state of consciousness and surrender. This beautiful ambiguity has inspired centuries of devotional poetry and philosophical contemplation. The eyes of Balaji remain one of Hinduism's most beloved divine mysteries.",
        "source": "Temple tradition, devotee testimonies",
        "image": "data/temples/tirupati/images/tirupati_balaji_darshan.png",
        "verified": true
    }
]